

&НаКлиенте
Процедура ЗаполнитьПоДокументу(Команда)
	ОткрытьФорму("Документ.РасчетРецепта.ФормаВыбора", ,ЭтаФорма , , , ,Новый ОписаниеОповещения("ЗаполнитьПоДокументу_Завершение", ЭтотОбъект) , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДокументу_Завершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	ЗаполнитьПоДокументуНаСервере(ВыбранноеЗначение);
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьПоДокументуНаСервере(ВыбранноеЗначение)
	ТаблицыДокумента = ВыбранноеЗначение.Метаданные().ТабличныеЧасти;
	Для каждого табЧасть из ТаблицыДокумента Цикл
		ТекущаяТаблицаДокумента = ВыбранноеЗначение[табЧасть.Имя];
		Для каждого элем из ТекущаяТаблицаДокумента Цикл
			новаяСтрока = Объект[табЧасть.имя].Добавить();
			ЗаполнитьЗначенияСвойств(новаяСтрока, элем);
		КонецЦикла;
		
	КонецЦикла;		
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыЗолотоНоменклатураПриИзменении(Элемент)
	РасчитатьЦенуПоНоменклатуре("ЗатратыЗолото");
КонецПроцедуры

&НаКлиенте
Процедура ПолучилиНоменклатураПриИзменении(Элемент)
	РасчитатьЦенуПоНоменклатуре("Получили");
КонецПроцедуры



&НаКлиенте
Процедура РасчитатьЦенуПоНоменклатуре(ИмяТабчасти)
	Элементы[ИмяТабчасти].ТекущиеДанные.цена = ПолучитьЦенуНоменклатуры(Элементы[ИмяТабчасти].ТекущиеДанные.Номенклатура);
КонецПроцедуры

Функция ПолучитьЦенуНоменклатуры(Номенклатура)
	Возврат РегистрыСведений.ЦеныНоменклатуры.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("Номенклатура",Номенклатура)).цена;
	
КонецФункции	
