

&НаКлиенте
Процедура ЗаполнитьПоДокументу(Команда)
	ОткрытьФорму("Документ.РасчетРецепта.ФормаВыбора", ,ЭтаФорма , , , ,Новый ОписаниеОповещения("ЗаполнитьПоДокументу_Завершение", ЭтотОбъект) , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДокументу_Завершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	ЗаполнитьПоДокументуНаСервере(ВыбранноеЗначение);
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьПоДокументуНаСервере(ВыбранноеЗначение)
	ТаблицыДокумента = ВыбранноеЗначение.Метаданные().ТабличныеЧасти;
	Для каждого табЧасть из ТаблицыДокумента Цикл
		ТекущаяТаблицаДокумента = ВыбранноеЗначение[табЧасть.Имя];
		Для каждого элем из ТекущаяТаблицаДокумента Цикл
			новаяСтрока = Объект[табЧасть.имя].Добавить();
			ЗаполнитьЗначенияСвойств(новаяСтрока, элем);
		КонецЦикла;
		
	КонецЦикла;		
КонецПроцедуры
