Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр МаржинальностьРецепта
	Движения.МаржинальностьРецепта.Записывать = Истина;
	Движение = Движения.МаржинальностьРецепта.Добавить();
	Движение.Период			= Дата;
	Движение.Рецепт 		= Рецепт;
	Движение.ОР1000 		= ОР1000;
	Движение.ОР1000РемРеп 	= ОР1000РемРеп;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры