

&НаКлиенте
Процедура ЗатратыЗолотоПриИзменении(Элемент)
	
	ПересчитатьТекущуюСтрокуТабЧасти("ЗатратыЗолото");
	 
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыРемонтнаяРепутацияПриИзменении(Элемент)
	
	ПересчитатьТекущуюСтрокуТабЧасти("ЗатратыРемонтнаяРепутация");
	 
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыОчкиРаботыПриИзменении(Элемент)
	
	ПересчитатьТекущуюСтрокуТабЧасти("ЗатратыОчкиРаботы");
	 
КонецПроцедуры

&НаКлиенте
Процедура КоличествоИтерацийПриИзменении(Элемент)
	КоличествоИтерацийПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КоличествоИтерацийПриИзмененииНаСервере()
	ПересчитатьТабЧасть("ЗатратыЗолото");
	ПересчитатьТабЧасть("ЗатратыРемонтнаяРепутация");
	ПересчитатьТабЧасть("ЗатратыОчкиРаботы");
КонецПроцедуры

Процедура ПересчитатьТабЧасть(ИмяТабчасти)
	Для каждого элем из Объект[ИмяТабчасти] Цикл
		элем.КоличествоДляПартии = Объект.КоличествоИтераций * элем.КоличествоДляШтуки;
		элем.СтимостьПартии 	 = элем.КоличествоДляПартии * элем.Цена; 
	КонецЦикла;	
	
КонецПроцедуры


&НаКлиенте
Процедура ПересчитатьТекущуюСтрокуТабЧасти(ИмяТабЧасти)
	
	Элементы[ИмяТабЧасти].ТекущиеДанные.КоличествоДляПартии = Объект.КоличествоИтераций * Элементы[ИмяТабЧасти].ТекущиеДанные.КоличествоДляШтуки;
	Элементы[ИмяТабЧасти].ТекущиеДанные.СтимостьПартии 		= Элементы[ИмяТабЧасти].ТекущиеДанные.КоличествоДляПартии* Элементы[ИмяТабЧасти].ТекущиеДанные.Цена;
	
КонецПроцедуры	
	