

&НаКлиенте
Процедура ЗатратыЗолотоПриИзменении(Элемент)
	
	ПересчитатьТекущуюСтрокуТабЧасти("ЗатратыЗолото");
	 
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыРемонтнаяРепутацияПриИзменении(Элемент)
	
	ПересчитатьТекущуюСтрокуТабЧасти("ЗатратыРемесленнаяРепутация");
	 
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыОчкиРаботыПриИзменении(Элемент)
	
	ПересчитатьТекущуюСтрокуТабЧасти("ЗатратыОчкиРаботы");
	 
КонецПроцедуры

&НаКлиенте
Процедура ПолучилиПриИзменении(Элемент)
	
	ПересчитатьТекущуюСтрокуТабЧасти("Получили");
	 
КонецПроцедуры

&НаКлиенте
Процедура КоличествоИтерацийПриИзменении(Элемент)
	ПересчитатьДокумент();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьДокумент()
	ПересчитатьТабЧасть("ЗатратыЗолото");
	ПересчитатьТабЧасть("ЗатратыРемесленнаяРепутация");
	ПересчитатьТабЧасть("ЗатратыОчкиРаботы");
	ПересчитатьТабЧасть("Получили");
КонецПроцедуры

&НаКлиенте
Процедура ЦенаРемонтнойРепутацииПриИзменении(Элемент)
	ПересчитатьТабЧасть("ЗатратыРемесленнаяРепутация");
КонецПроцедуры

&НаКлиенте
Процедура РецептПриИзменении(Элемент)
	РецептПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура РецептПриИзмененииНаСервере()
	а=1;
КонецПроцедуры



Процедура ПересчитатьТабЧасть(ИмяТабчасти)
	Для каждого элем из Объект[ИмяТабчасти] Цикл
		элем.КоличествоДляПартии = Объект.КоличествоИтераций * элем.КоличествоДляШтуки;
		элем.СтоимостьПартии 	 = элем.КоличествоДляПартии * элем.Цена; 
		Если ИмяТабчасти = "ЗатратыРемесленнаяРепутация" Тогда
			элем.СтоимостьЗолотом = элем.СтоимостьПартии * Объект.ЦенаРемесленнойРепутации;
		КонецЕсли;
	КонецЦикла;	
	РасчетПоказателей();
КонецПроцедуры


&НаКлиенте
Процедура ПересчитатьТекущуюСтрокуТабЧасти(ИмяТабЧасти)
	
	Элементы[ИмяТабЧасти].ТекущиеДанные.КоличествоДляПартии = Объект.КоличествоИтераций * Элементы[ИмяТабЧасти].ТекущиеДанные.КоличествоДляШтуки;
	Элементы[ИмяТабЧасти].ТекущиеДанные.СтоимостьПартии 		= Элементы[ИмяТабЧасти].ТекущиеДанные.КоличествоДляПартии* Элементы[ИмяТабЧасти].ТекущиеДанные.Цена;
	Если ИмяТабчасти = "ЗатратыРемесленнаяРепутация" Тогда
		Элементы[ИмяТабЧасти].ТекущиеДанные.СтоимостьЗолотом	= Элементы[ИмяТабЧасти].ТекущиеДанные.СтоимостьПартии * Объект.ЦенаРемесленнойРепутации;
	КонецЕсли;
	РасчетПоказателей();
КонецПроцедуры

Процедура РасчетПоказателей()
	Объект.РемесленнаяРепутация 		= Объект.ЗатратыРемесленнаяРепутация.Итог("СтоимостьПартии");
	Объект.РемесленнаяРепутацияЗолотом  = Объект.ЗатратыРемесленнаяРепутация.Итог("СтоимостьЗолотом");
	Объект.ОР							= Объект.ЗатратыОчкиРаботы.Итог("СтоимостьПартии");
	Объект.Прибыль						= Объект.Получили.Итог("СтоимостьПартии");
	Объект.Золото						= Объект.ЗатратыЗолото.Итог("СтоимостьПартии");
	
	Объект.Маржа 			= Объект.Прибыль -  Объект.Золото;
	Объект.МоаржаСРемРеп 	= Объект.Маржа 	 -  Объект.РемесленнаяРепутацияЗолотом;
	
	Если Объект.ОР=0 Тогда
		Объект.ОР1000			= 0;
		Объект.ОР1000РемРеп		= 0;
	Иначе		 
		Объект.ОР1000			= Объект.Маржа / Объект.ОР * 1000;
		Объект.ОР1000РемРеп		= Объект.МоаржаСРемРеп / Объект.ОР * 1000;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоРецепту(Команда)
	Если ЗначениеЗаполнено(Объект.Рецепт) Тогда
		ЗаполнитьПоРецептуНаСервере(Объект.Рецепт);
	КонецЕсли;	
КонецПроцедуры
	
&НаСервере
Процедура ЗаполнитьПоРецептуНаСервере(Рецепт)
	ТаблицыДокумента = Рецепт.Метаданные().ТабличныеЧасти;
	Для каждого табЧасть из ТаблицыДокумента Цикл
		ТекущаяТаблицаДокумента = Рецепт[табЧасть.Имя];
		Объект[табЧасть.имя].Очистить();
		Для каждого элем из ТекущаяТаблицаДокумента Цикл
			новаяСтрока = Объект[табЧасть.имя].Добавить();
			ЗаполнитьЗначенияСвойств(новаяСтрока, элем);
		КонецЦикла;
	КонецЦикла;	
	ПересчитатьДокумент();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Рецепт") И ЗначениеЗаполнено(Параметры.Рецепт) Тогда
		Объект.Рецепт = Параметры.Рецепт;
		ЗаполнитьПоРецептуНаСервере(Объект.Рецепт);
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыЗолотоНоменклатураПриИзменении(Элемент)
	РасчитатьЦенуПоНоменклатуре("ЗатратыЗолото");
КонецПроцедуры

&НаКлиенте
Процедура ПолучилиНоменклатураПриИзменении(Элемент)
	РасчитатьЦенуПоНоменклатуре("Получили");
КонецПроцедуры


&НаКлиенте
Процедура РасчитатьЦенуПоНоменклатуре(ИмяТабчасти)
	Элементы[ИмяТабчасти].ТекущиеДанные.цена = ПолучитьЦенуНоменклатуры(Элементы[ИмяТабчасти].ТекущиеДанные.Номенклатура);
КонецПроцедуры

Функция ПолучитьЦенуНоменклатуры(Номенклатура)
	Возврат РегистрыСведений.ЦеныНоменклатуры.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("Номенклатура",Номенклатура)).цена;
	
КонецФункции	



	