

&НаКлиенте
Процедура ВыполнитьРасчет(Команда)
	ТекущаяСтрока =  Элементы.Список.ТекущиеДанные;
	Если не ТекущаяСтрока.ЭтоГруппа Тогда
		ОткрытьФорму("Документ.РасчетРецепта.Форма.ФормаДокумента",Новый Структура("Рецепт",ТекущаяСтрока.Ссылка));
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;
	СписокДокументов.Отбор.Элементы.Очистить();
	элемОтбора = СписокДокументов.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	элемОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Рецепт");


	Если Элементы.Список.ТекущиеДанные.ЭтоГруппа Тогда
		элемОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВИерархии;	
	Иначе		
		элемОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;	
	элемОтбора.ПравоеЗначение	= Элементы.Список.ТекущиеДанные.Ссылка;
	элемОтбора.Использование	= Истина

КонецПроцедуры

